
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/goda6565/portfolio/actions/runs/16169669033)



<pre><code>Apply complete! Resources: 4 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.bootstrap.data.google_project.project: Reading...
module.bootstrap.google_project_service.service["iam.googleapis.com"]: Refreshing state... [id=portfolio-460206/iam.googleapis.com]
module.bootstrap.google_project_service.service["storage.googleapis.com"]: Refreshing state... [id=portfolio-460206/storage.googleapis.com]
module.bootstrap.google_project_service.service["cloudbuild.googleapis.com"]: Refreshing state... [id=portfolio-460206/cloudbuild.googleapis.com]
module.bootstrap.google_project_service.service["artifactregistry.googleapis.com"]: Refreshing state... [id=portfolio-460206/artifactregistry.googleapis.com]
module.bootstrap.google_project_service.service["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=portfolio-460206/cloudresourcemanager.googleapis.com]
module.bootstrap.google_project_service.service["secretmanager.googleapis.com"]: Refreshing state... [id=portfolio-460206/secretmanager.googleapis.com]
module.bootstrap.google_project_service.service["sts.googleapis.com"]: Refreshing state... [id=portfolio-460206/sts.googleapis.com]
module.bootstrap.google_project_service.service["run.googleapis.com"]: Refreshing state... [id=portfolio-460206/run.googleapis.com]
module.bootstrap.google_project_service.service["iap.googleapis.com"]: Refreshing state... [id=portfolio-460206/iap.googleapis.com]
module.bootstrap.data.google_project.project: Read complete after 0s [id=projects/portfolio-460206]
module.bootstrap.google_iam_workload_identity_pool.github_actions_pool: Refreshing state... [id=projects/portfolio-460206/locations/global/workloadIdentityPools/github-actions-wip-pool]
module.bootstrap.google_service_account.terraform_executor: Refreshing state... [id=projects/portfolio-460206/serviceAccounts/terraform-executor@portfolio-460206.iam.gserviceaccount.com]
module.cloudbuild_connection.data.google_secret_manager_secret_version.github_oauth_token: Reading...
module.cloudbuild_connection.data.google_secret_manager_secret_version.github_oauth_token: Read complete after 0s [id=projects/186242794041/secrets/github-host-github-oauthtoken-f6b0df/versions/1]
module.artifact_registry.google_artifact_registry_repository.artifact_registry_repository: Refreshing state... [id=projects/portfolio-460206/locations/asia-northeast1/repositories/portfolio]
module.bootstrap.data.google_iam_role.roles_storage_object_user: Reading...
module.bootstrap.data.google_iam_role.roles_storage_object_user: Read complete after 0s [id=roles/storage.objectUser]
module.cloudbuild_connection.google_service_account.cloudbuild_service_account: Refreshing state... [id=projects/portfolio-460206/serviceAccounts/cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com]
module.bootstrap.google_iam_workload_identity_pool_provider.github_actions_pool_provider: Refreshing state... [id=projects/portfolio-460206/locations/global/workloadIdentityPools/github-actions-wip-pool/providers/github-actions-pool-provider]
module.bootstrap.google_project_iam_member.terraform_executor: Refreshing state... [id=portfolio-460206/roles/owner/serviceAccount:terraform-executor@portfolio-460206.iam.gserviceaccount.com]
module.cloudbuild_connection.google_cloudbuildv2_connection.github_connection: Refreshing state... [id=projects/portfolio-460206/locations/us-west2/connections/github-connection]
module.bootstrap.google_project_iam_custom_role.custom_storage_object_user: Refreshing state... [id=projects/portfolio-460206/roles/customStorageObjectUser]
module.cloudbuild_connection.google_project_iam_member.cloudbuild_roles["roles/artifactregistry.writer"]: Refreshing state... [id=portfolio-460206/roles/artifactregistry.writer/serviceAccount:cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com]
module.cloudbuild_connection.google_project_iam_member.cloudbuild_roles["roles/secretmanager.secretAccessor"]: Refreshing state... [id=portfolio-460206/roles/secretmanager.secretAccessor/serviceAccount:cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com]
module.cloudbuild_connection.google_project_iam_member.cloudbuild_roles["roles/logging.logWriter"]: Refreshing state... [id=portfolio-460206/roles/logging.logWriter/serviceAccount:cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com]
module.cloudbuild_connection.google_project_iam_member.cloudbuild_roles["roles/run.admin"]: Refreshing state... [id=portfolio-460206/roles/run.admin/serviceAccount:cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com]
module.cloudbuild_connection.google_project_iam_member.cloudbuild_roles["roles/iam.serviceAccountUser"]: Refreshing state... [id=portfolio-460206/roles/iam.serviceAccountUser/serviceAccount:cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com]
module.cloudbuild_connection.google_project_iam_member.cloudbuild_roles["roles/cloudbuild.workerPoolUser"]: Refreshing state... [id=portfolio-460206/roles/cloudbuild.workerPoolUser/serviceAccount:cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com]
module.bootstrap.google_service_account_iam_member.terraform_workload_identity_user: Refreshing state... [id=projects/portfolio-460206/serviceAccounts/terraform-executor@portfolio-460206.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/186242794041/locations/global/workloadIdentityPools/github-actions-wip-pool/attribute.repository/goda6565/portfolio]
module.cloudbuild_connection.google_cloudbuildv2_repository.github_repository: Refreshing state... [id=projects/portfolio-460206/locations/us-west2/connections/github-connection/repositories/portfolio]
module.bootstrap.google_storage_bucket_iam_member.terraform_executor_storage_object_user: Refreshing state... [id=b/portfolio-shared-terraform-backend/projects/portfolio-460206/roles/customStorageObjectUser/serviceAccount:terraform-executor@portfolio-460206.iam.gserviceaccount.com]
module.cloudbuild_frontend_trigger.google_cloudbuild_trigger.github_trigger: Refreshing state... [id=projects/portfolio-460206/locations/us-west2/triggers/22c2e866-1b3b-459d-a43e-3f40e1f3df1a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.auth_service_jwt_secret.google_secret_manager_secret.secret will be created
  + resource "google_secret_manager_secret" "secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "portfolio-460206"
      + secret_id             = "auth-service-jwt-secret"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + user_managed {
              + replicas {
                  + location = "asia-northeast1"
                }
            }
        }
    }

  # module.auth_service_user_email.google_secret_manager_secret.secret will be created
  + resource "google_secret_manager_secret" "secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "portfolio-460206"
      + secret_id             = "auth-service-user-email"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + user_managed {
              + replicas {
                  + location = "asia-northeast1"
                }
            }
        }
    }

  # module.auth_service_user_password.google_secret_manager_secret.secret will be created
  + resource "google_secret_manager_secret" "secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "portfolio-460206"
      + secret_id             = "auth-service-user-password"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + user_managed {
              + replicas {
                  + location = "asia-northeast1"
                }
            }
        }
    }

  # module.cloudbuild_auth_trigger.google_cloudbuild_trigger.github_trigger will be created
  + resource "google_cloudbuild_trigger" "github_trigger" {
      + create_time        = (known after apply)
      + description        = "Build trigger for auth-service"
      + filename           = "manifests/cloudbuild/auth-service.yaml"
      + id                 = (known after apply)
      + include_build_logs = "INCLUDE_BUILD_LOGS_WITH_STATUS"
      + included_files     = [
          + "apps/auth-service/**",
        ]
      + location           = "us-west2"
      + name               = "auth-service-trigger"
      + project            = "portfolio-460206"
      + service_account    = "projects/portfolio-460206/serviceAccounts/cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com"
      + trigger_id         = (known after apply)

      + approval_config (known after apply)

      + repository_event_config {
          + repository = "projects/portfolio-460206/locations/us-west2/connections/github-connection/repositories/portfolio"

          + push {
              + branch = "^(main|feat/.*)$"
            }
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
module.auth_service_jwt_secret.google_secret_manager_secret.secret: Creating...
module.auth_service_user_password.google_secret_manager_secret.secret: Creating...
module.auth_service_user_email.google_secret_manager_secret.secret: Creating...
module.cloudbuild_auth_trigger.google_cloudbuild_trigger.github_trigger: Creating...
module.cloudbuild_auth_trigger.google_cloudbuild_trigger.github_trigger: Creation complete after 0s [id=projects/portfolio-460206/locations/us-west2/triggers/231f7bf3-291f-4653-9478-2dbe114dcf60]
module.auth_service_user_password.google_secret_manager_secret.secret: Creation complete after 0s [id=projects/portfolio-460206/secrets/auth-service-user-password]
module.auth_service_jwt_secret.google_secret_manager_secret.secret: Creation complete after 1s [id=projects/portfolio-460206/secrets/auth-service-jwt-secret]
module.auth_service_user_email.google_secret_manager_secret.secret: Creation complete after 1s [id=projects/portfolio-460206/secrets/auth-service-user-email]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

Outputs:

github_oidc_workload_identity_user = "principalSet://iam.googleapis.com/projects/186242794041/locations/global/workloadIdentityPools/github-actions-wip-pool/attribute.repository/goda6565/portfolio"
project_number = "186242794041"

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":52,"Program":"tfcmt","SHA1":"69ee5e8014a4496bf28040dcb22874db973931cb","Vars":{},"WorkflowName":"Terraform Multi-Env CI"} -->